# **<center><span style= "color:#2F539B;">Data merging and concatenation</span></center>**

In [1]:
import pandas as pd

In [ ]:
# creating the datasets
data1 = {'id': [1,2,3],
         'name': ['Ahmed','Fatima','Ali'],
         'age': [28,32,24]
         }
df1 = pd.DataFrame(data1)

data2 = {'id': [1,2,3],
         'city': ['Karachi','Lahore','Islamabad'],
         'occupation': ['Engineer','Doctor','Teacher']
         }
df2 = pd.DataFrame(data2)

In [12]:
df1

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [13]:
df2

   id       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [14]:
# Merging df1 and df2
merged_df = pd.merge(df1,df2, on='id', how='inner')

In [15]:
merged_df

   id    name  age       city occupation
0   1   Ahmed   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

# concatenation

In [16]:
# concatenation use for to merge the data on the base of rows or columns
data1 = {'Name': ['Ahmed','Fatima','Ali'],
         'Age': [28,32,24]
         }
data2 = {'Name': ['sara','usman','aisha'],
         'Age': [29,35,27]}
data3 = {'City': ['Karachi','Lahore','Islamabad'],
         'Province': ['Sindh', 'Punjab', 'Punjab']
         }
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [17]:
# concatenate rows 
concatenated_rows = pd.concat([df1,df2])

In [18]:
concatenated_rows

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    sara   29
1   usman   35
2   aisha   27

In [19]:
# concatenated columns 
concatenated_cols = pd.concat([df1,df3], axis=1)

In [20]:
concatenated_cols

     Name  Age       City Province
0   Ahmed   28    Karachi    Sindh
1  Fatima   32     Lahore   Punjab
2     Ali   24  Islamabad   Punjab